code-review/NRB_3471_3546/База_Было/Catalogs/КонтрольПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтрольПоручений</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкиСКД</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СобытияКонтроляПоручений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСобытиеКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправкаУведомленияПоЭлектроннойПочте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПеременныхШаблонаРеквизитам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПеременной</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКРеквизиту</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СобытияКонтроляПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СобытияКонтроляПоручений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриПроведенииСЗапретом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/КонтрольПоручений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоКопирование = Не Параметры.ЗначениеКопирования.Пустая();
	
	Если Не ЭтоКопирование И Параметры.Ключ.Пустая() Тогда
		
		Объект.СобытиеКонтроля = Перечисления.СобытияКонтроляПоручений.ПриПроведении;
		
		Объект.Актуальность = Истина;
		
	КонецЕсли;
	
	ДанныеОбъект = РеквизитФормыВЗначение("Объект");
	
	СхемаКомпоновки = ДанныеОбъект.ПолучитьМакет("МакетОтбораПоручений");
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВоВременномХранилище);
	
	КомпоновщикСхемы.Инициализировать(ИсточникНастроек);
	
	Если ЭтоКопирование Тогда
		
		СохраненнаяНастройка = Параметры.ЗначениеКопирования.НастройкиСКД.Получить();
		
	Иначе
		
		СохраненнаяНастройка = ДанныеОбъект.НастройкиСКД.Получить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СохраненнаяНастройка) Тогда
		
		КомпоновщикСхемы.ЗагрузитьНастройки(СохраненнаяНастройка);
		
	Иначе
		
		КомпоновщикСхемы.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкиСКД = Новый ХранилищеЗначения(Этотобъект.КомпоновщикСхемы.Настройки);
	
КонецПроцедуры

#КонецОбласти
